In [1]:
import pandas as pd
import numpy as np

**Loading, cleaning, transforming and rearranging** take up 80% or more of an analyst's time.  

Sometimes the way that data is stored in files or databases is not in the right format for a particular task. Many researchers choose to do ad hoc processing of data from one form to another using a general-purpose programming language, like Python, Perl, R or Java to manipulate data into the right form.

# 1. Handling Missing Data

For numeric data, pandas uses the floating-point value **NaN**(Not a Number) to represent missing data. (*sentinel value*)

In [2]:
string_data = pd.Series(['a','bb','ccc',np.nan, 'dddd'])
string_data

0       a
1      bb
2     ccc
3     NaN
4    dddd
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [4]:
string_data[0] = None # Python build-in object
string_data.isnull()

0     True
1    False
2    False
3     True
4    False
dtype: bool

* **dropna**: Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.  
* **fillna**: Fill in missing data with some value or using an interpolation method such as'ffill'or'bfill'.  
* **isnull**: return boolean values indicating which values are missing/NA.  
* **notnull**: Negation of isnull.

In [5]:
string_data.fillna(0)

0       0
1      bb
2     ccc
3       0
4    dddd
dtype: object

In [6]:
string_data.ffill() # NaN filled same as previous value

0    None
1      bb
2     ccc
3     ccc
4    dddd
dtype: object

In [7]:
string_data.bfill() # NaN filled same as later value

0      bb
1      bb
2     ccc
3    dddd
4    dddd
dtype: object

In [8]:
string_data.dropna()

1      bb
2     ccc
4    dddd
dtype: object

## Filtering Out Missing Data

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3, 4, NA, 5])

In [11]:
data.dropna()

0    1.0
2    3.0
3    4.0
5    5.0
dtype: float64

In [12]:
data[data.isnull()]

1   NaN
4   NaN
dtype: float64

In [13]:
data[data.notnull()] # Equivalent to dropna().

0    1.0
2    3.0
3    4.0
5    5.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows or columns that are all NA or only those containing any NAs.

In [14]:
data = pd.DataFrame([[1., 2., 3.], 
                     [4., NA, NA],
                     [NA, NA, NA], 
                     [NA, 11., 12.]])
data

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  11.0  12.0

> *dropna() by default drops any row containing a missing value*

In [15]:
data.dropna()

     0    1    2
0  1.0  2.0  3.0

> *passing **how='all'** will only drop rows that are all NaN.*

In [16]:
data.dropna(how='all')

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
3  NaN  11.0  12.0

In [17]:
data['4'] = NA

In [18]:
data

     0     1     2   4
0  1.0   2.0   3.0 NaN
1  4.0   NaN   NaN NaN
2  NaN   NaN   NaN NaN
3  NaN  11.0  12.0 NaN

> To drop columns in the same way, pass **axis=1**.

In [19]:
data.dropna(axis=1, how='all')

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  11.0  12.0

If we only want to keep rows containing a certain number of observations. We can add **thresh** augument.

In [20]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.768754       NaN       NaN
1 -0.975189       NaN       NaN
2 -0.104522       NaN -0.435914
3 -0.152296       NaN  0.698945
4 -0.101068  0.295122 -0.891681
5 -0.718015  1.277747  0.600519
6  0.793561 -0.707375 -0.024787

In [21]:
df.dropna() # drop all the rows contains NaN

          0         1         2
4 -0.101068  0.295122 -0.891681
5 -0.718015  1.277747  0.600519
6  0.793561 -0.707375 -0.024787

In [22]:
df[3] = NA
df[3].astype('float')
df

          0         1         2   3
0 -0.768754       NaN       NaN NaN
1 -0.975189       NaN       NaN NaN
2 -0.104522       NaN -0.435914 NaN
3 -0.152296       NaN  0.698945 NaN
4 -0.101068  0.295122 -0.891681 NaN
5 -0.718015  1.277747  0.600519 NaN
6  0.793561 -0.707375 -0.024787 NaN

In [23]:
df.dropna(thresh=3) # Keep only the rows with at least 3 non-na values:

          0         1         2   3
4 -0.101068  0.295122 -0.891681 NaN
5 -0.718015  1.277747  0.600519 NaN
6  0.793561 -0.707375 -0.024787 NaN

## Filling In Missing Data

In [24]:
df

          0         1         2   3
0 -0.768754       NaN       NaN NaN
1 -0.975189       NaN       NaN NaN
2 -0.104522       NaN -0.435914 NaN
3 -0.152296       NaN  0.698945 NaN
4 -0.101068  0.295122 -0.891681 NaN
5 -0.718015  1.277747  0.600519 NaN
6  0.793561 -0.707375 -0.024787 NaN

In [25]:
df.fillna(0)

          0         1         2    3
0 -0.768754  0.000000  0.000000  0.0
1 -0.975189  0.000000  0.000000  0.0
2 -0.104522  0.000000 -0.435914  0.0
3 -0.152296  0.000000  0.698945  0.0
4 -0.101068  0.295122 -0.891681  0.0
5 -0.718015  1.277747  0.600519  0.0
6  0.793561 -0.707375 -0.024787  0.0

> By passing a dictionary, can use different fill value for each column.

In [26]:
df.fillna({1: 0.9999, 2: 0.8888, 3:0.7777 })

          0         1         2       3
0 -0.768754  0.999900  0.888800  0.7777
1 -0.975189  0.999900  0.888800  0.7777
2 -0.104522  0.999900 -0.435914  0.7777
3 -0.152296  0.999900  0.698945  0.7777
4 -0.101068  0.295122 -0.891681  0.7777
5 -0.718015  1.277747  0.600519  0.7777
6  0.793561 -0.707375 -0.024787  0.7777

> fillna returns a new object, but add argument inplace=Ture will change inplace.

In [27]:
df.fillna(0, inplace=True)
df

          0         1         2    3
0 -0.768754  0.000000  0.000000  0.0
1 -0.975189  0.000000  0.000000  0.0
2 -0.104522  0.000000 -0.435914  0.0
3 -0.152296  0.000000  0.698945  0.0
4 -0.101068  0.295122 -0.891681  0.0
5 -0.718015  1.277747  0.600519  0.0
6  0.793561 -0.707375 -0.024787  0.0

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.505359 -0.692384  1.458765
1  0.433390  0.815488 -1.063252
2  0.336729       NaN -0.021520
3 -0.163062       NaN  1.816939
4  0.349794       NaN       NaN
5 -1.349562       NaN       NaN

In [29]:
df.fillna(method='ffill') # fill the value the same as upper one.

          0         1         2
0  0.505359 -0.692384  1.458765
1  0.433390  0.815488 -1.063252
2  0.336729  0.815488 -0.021520
3 -0.163062  0.815488  1.816939
4  0.349794  0.815488  1.816939
5 -1.349562  0.815488  1.816939

* **value**: Scalar value or dict-like object to use to  ll missing values
* **method**: Interpolation; by default'ffill'if function called with no other 
* **axis**: arguments Axis to  ll on; defaultaxis=0
* **inplace**: Modify the calling object without producing a copy
* **limit**: For forward and backward  lling, maximum number of consecutive periods to  ll

# 2. Data Transformation

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

The DataFrame method duplicated returns a boolean Series indicating whether each row is a duplicate or not.

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

drop_duplicates returns a DataFrame where the duplicated array is False

In [33]:
data.loc[~data.duplicated()]
# equal to drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [34]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

duplicated and drop_duplicates by default keep the first observed value combina tion. Passing keep='last' will return the last one.

## Transforming Data Using a Function or Mapping

In [35]:
dict = {
'food': [
    'bacon', 'pulled pork', 'bacon',
    'Pastrami', 'corned beef', 'Bacon',
    'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
}

data = pd.DataFrame(dict)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

Convert each value of food to lowercase using **str.lower** Series method.

In [37]:
lowercase_food = data['food'].str.lower()
type(lowercase_food)

pandas.core.series.Series

In [38]:
data['animal'] = lowercase_food.map(meat_to_animal)
# pass a dict-like object

The map method on a Series accepts a **function** or **dict-like object** containing a mapping.

In [39]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
# or pass a function
lowercase_food.map(lambda x: meat_to_animal[x])
# or 
# data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations and other data cleaningrelated operations.

## Replacing Values
Filling in missing data with the fillna method is a special case of more general value replacement. As youve already seen, map can be used to modify a subset of values in an object but replace provides a simpler and more flexible way to do so

In [41]:
data = pd.Series([1,2,3,999,4,999,5,999,6])
data

0      1
1      2
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [42]:
data.replace(999, np.nan)

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
6    5.0
7    NaN
8    6.0
dtype: float64

In [43]:
data.replace([1,2], 100)

0    100
1    100
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [44]:
data.replace([1,2], [100,200])

0    100
1    200
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [45]:
data.replace({
    1: 100,
    2: 200,
    3: 300
})

0    100
1    200
2    300
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

## Renaming Axis Indexes

In [46]:
index = ['aaa', 'bbb','ccc']
columns = ['one', 'two', 'three', 'four']
data = pd.DataFrame(np.arange(12).reshape((3,4)), index=index, columns=columns)
data

     one  two  three  four
aaa    0    1      2     3
bbb    4    5      6     7
ccc    8    9     10    11

In [47]:
data.index = data.index.map(lambda x: x.upper())
data

     one  two  three  four
AAA    0    1      2     3
BBB    4    5      6     7
CCC    8    9     10    11

In [48]:
mapping = {
    'one': '1',
    'two': '2',
    'three': '3',
    'four': '4'
}
data.columns.map(lambda x: mapping[x])

Index(['1', '2', '3', '4'], dtype='object')

In [49]:
data.rename(index=str.title, columns=str.upper)

     ONE  TWO  THREE  FOUR
Aaa    0    1      2     3
Bbb    4    5      6     7
Ccc    8    9     10    11

In [50]:
data.rename(index={'AAA': 'aa'}, columns={'three': 'Three'}, inplace=True)
data

     one  two  Three  four
aa     0    1      2     3
BBB    4    5      6     7
CCC    8    9     10    11

## ? Discretization and Binning ?

In [51]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
# divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Pandas returns a special **Categorical object**

In [52]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [53]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [54]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [55]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

....

....

....

## Detecting and Filtering Outliers

In [56]:
data = pd.DataFrame(np.random.randn(1000, 4))
# random Gaussian distribution of shape(1000,4)

In [57]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.020485     0.023628    -0.009476     0.028912
std       1.021912     0.964195     0.978529     1.013745
min      -2.636182    -3.633809    -3.149752    -2.829734
25%      -0.696201    -0.574888    -0.693024    -0.670310
50%      -0.037198     0.007103    -0.019712     0.027697
75%       0.653569     0.642157     0.669598     0.704799
max       3.811491     2.763248     3.140508     2.874368

In [58]:
col_1 = data[0]
col_1[np.abs(col_1)>3]

123    3.151072
733    3.742500
803    3.811491
892    3.006143
Name: 0, dtype: float64

In [59]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
55  -0.498905  0.733018  3.140508 -0.023115
62   0.051136 -3.633809  0.344742 -1.357065
123  3.151072  0.462970 -0.254058 -0.328188
677  0.233039 -0.341709 -3.149752  0.907032
733  3.742500 -0.417632 -0.485591  0.682174
803  3.811491  0.544860 -2.312954  1.252566
892  3.006143  0.018347  1.238002  1.455633

In [60]:
data.loc[(np.abs((data[0]+data[1]+data[2]+data[3]))>3)]
# select sum greater than 3

            0         1         2         3
11   1.816890  1.135013  0.672329  0.073682
13   0.984056  0.084016  0.766381  1.627755
16  -2.356290 -0.253698 -1.210028  0.597282
20  -1.371144 -0.402635 -0.930699 -0.479147
23   0.903283  1.216533  0.800504  1.042535
35  -1.190941 -0.451651  0.123420 -1.796865
36  -0.279248 -0.438289 -1.660548 -1.511383
41  -1.451706  0.492405 -0.587230 -2.227420
42   1.073682 -2.401908 -0.614835 -1.196621
46  -0.802036  0.049516 -0.594304 -2.252716
54   0.299810  1.777495  0.406869  2.874368
55  -0.498905  0.733018  3.140508 -0.023115
61  -0.231074 -2.377833 -0.736116 -1.109613
62   0.051136 -3.633809  0.344742 -1.357065
77   2.157244  1.043495  0.032761 -0.223265
84  -1.045720  1.262009 -2.367479 -1.175416
88   1.108027  1.608226  1.052833 -0.284848
90   0.461910  1.956968  0.549169  0.277093
91  -0.440491 -0.988610  1.067609 -2.829734
98  -0.540201 -1.729164 -1.709088 -1.007036
101 -0.841479  1.003221 -2.178161 -1.726682
106 -0.924947 -1.852211 -0.107852 -1.880561
121  0.435140  1.243089  0.502652  1.287912
123  3.151072  0.462970 -0.254058 -0.328188
125  1.347668  1.122784  1.207973 -0.269992
138 -0.907593 -0.222143 -1.136256 -2.138685
148 -0.143202 -1.473266  0.387994 -2.228408
152 -2.195853 -0.406652 -0.459629 -0.613894
162 -1.548781  0.018544 -1.755234  0.056431
175 -0.732510 -1.499951 -0.334760 -0.806162
..        ...       ...       ...       ...
782 -0.729706 -0.005130 -1.381192 -1.517672
789 -0.576909 -1.763695 -0.135233 -1.804107
793  1.066229  2.412451 -0.704492  1.100517
795 -1.219358 -1.827286  0.431436 -1.263020
803  3.811491  0.544860 -2.312954  1.252566
807 -1.175603  0.624951 -2.063883 -1.372935
814 -1.153032 -0.238482 -1.508198 -1.120782
815  0.088332  0.516192  2.873629  0.311347
829 -0.658322 -2.191107 -1.203468  0.174898
836  0.845222 -2.379717 -0.986818 -1.886787
851 -0.440068  0.521757 -2.112758 -1.294670
861  0.930425  1.727138  0.437992  0.300689
876  0.429417  1.237581  1.507073  1.954635
879 -0.716515 -0.721378 -0.921740 -1.244804
880 -1.856962 -1.339117 -0.724785 -2.352587
892  3.006143  0.018347  1.238002  1.455633
896 -0.195634  1.235087  1.387211  1.418526
908 -2.412509 -0.119103  0.929204 -1.725264
917 -0.291991  2.719336  1.163072  1.626636
919 -0.345614  0.023791 -1.941619 -2.094957
935 -1.478656 -1.494647 -0.818754 -0.647610
936  0.455390  2.145141  0.842626 -0.125877
950 -1.632155 -0.191043 -0.513045 -1.458930
964 -2.273232 -1.059166  0.230291 -1.321868
969 -1.311030 -0.526279 -1.445898 -1.163865
970 -0.196523  2.191877  0.706080  0.396096
971  2.320648 -0.150877  1.004443  1.992144
973  1.265335  2.115117  0.551459 -0.475532
981 -0.679062 -0.885954 -1.560569 -0.346175
996  0.515710 -0.119394  0.392196  2.510470

[130 rows x 4 columns]

In [61]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
55  -0.498905  0.733018  3.140508 -0.023115
62   0.051136 -3.633809  0.344742 -1.357065
123  3.151072  0.462970 -0.254058 -0.328188
677  0.233039 -0.341709 -3.149752  0.907032
733  3.742500 -0.417632 -0.485591  0.682174
803  3.811491  0.544860 -2.312954  1.252566
892  3.006143  0.018347  1.238002  1.455633

## ? Permutation and Random Sampling ?

## Computing Indicator/Dummy Variables

In [62]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [63]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [64]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

# 3. String Manipulation

In [70]:
val = 'a, b,   c'
val.split(',')

['a', ' b', '   c']

In [71]:
pieces = [x.strip() for x in val.split(',')]
# split() is often combined with strip() to trim whitespace
pieces

['a', 'b', 'c']

In [72]:
a,b,c = pieces
a+'::'+b+'::'+c

'a::b::c'

But this isnt a practical generic method. A faster and more Pythonic way is to pass a list or tuple to the join method on the string '::':

In [73]:
'::'.join(pieces)

'a::b::c'

In [74]:
val.count(',')

2

In [75]:
val.replace(',','...')

'a... b...   c'

## Vectorized String Function in pandas

In [78]:
data = {'Dave': 'dave@google.com', 
        'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 
        'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [79]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [81]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [83]:
data.str[:4]

Dave     dave
Rob      rob@
Steve    stev
Wes       NaN
dtype: object